package application

const (
	CommonDots = "..."

	MsgCockScoreboardNotFound = "\n🥀 *Тебе соболезнуем... потому что не смотрел на кок!*"

	MsgCockSize                    = "Мой кок: *%dсм* %s"
	MsgCockRulerScoreboardDefault  = "%s @%s *%dсм* %s"
	MsgCockRulerScoreboardSelected = "%s *@%s %dсм* %s"
	MsgCockRulerScoreboardOut      = "\n🥀 *И %s твой кок %dсм* %s"

	MsgCockRaceScoreboardDefault  = "%s @%s *%sсм*"
	MsgCockRaceScoreboardSelected = "%s *@%s %sсм*"
	MsgCockRaceScoreboardOut      = "\n🥀 *И %s твой кок %sсм*"

	MsgCockRulerScoreboardTemplate = `*Линейка коков:*

🏆 Победители в номинации:

%s

🥀 Остальным соболезнуем:

%s

_Линейка коков – чистый рандом, сегодня ты бог, завтра ты лох. Все коки сбрасываются каждые сутки по МСК!_`

	MsgCockRulerScoreboardWinnersTemplate = `*Линейка коков:*

🏆 Победители в номинации:

%s

_Линейка коков – чистый рандом, сегодня ты бог, завтра ты лох. Все коки сбрасываются каждые сутки по МСК!_`

	MsgCockRaceScoreboardTemplate = `*Участники гонки коков:*

🏆 Победители в номинации:

%s

🥀 Остальным соболезнуем:

%s

_Гонка коков – это соревнование, в котором коки участников суммируются за весь сезон. Период обновления коков – сутки_
  
🚀 Текущий сезон гонки коков стартовал *16.12.2024*`

	MsgCockRaceScoreboardWinnersTemplate = `*Участники гонки коков:*

🏆 Победители в номинации:

%s

_Гонка коков – это соревнование, в котором коки участников суммируются за весь сезон. Период обновления коков – сутки_
  
🚀 Текущий сезон гонки коков стартовал *16.12.2024*`
)
