package application

const (
	CommonDots = "..."

	MsgCockScoreboardNotFound = "\n🥀 *Тебе соболезнуем... потому что не смотрел на кок!*"

	MsgCockSize                    = "Мой кок: *%dсм* %s"
	MsgCockRulerScoreboardDefault  = "%s @%s *%dсм* %s"
	MsgCockRulerScoreboardSelected = "%s *@%s %dсм* %s"
	MsgCockRulerScoreboardOut      = "\n🥀 *И %s твой кок %dсм* %s"

	MsgCockRaceScoreboardDefault  = "%s @%s *%sсм*"
	MsgCockRaceScoreboardSelected = "%s *@%s %sсм*"
	MsgCockRaceScoreboardOut      = "\n🥀 *И %s твой кок %sсм*"

	MsgCockRulerScoreboardTemplate = `*Линейка коков:*

🏆 Победители в номинации:

%s

🥀 Остальным, соболезнуем:

%s

_Линейка коков – чистый рандом, сегодня ты бог, завтра ты лох. Все коки сбрасываются каждые сутки!_`

	MsgCockRulerScoreboardWinnersTemplate = `*Линейка коков:*

🏆 Победители в номинации:

%s

_Линейка коков – чистый рандом, сегодня ты бог, завтра ты лох. Все коки сбрасываются каждые сутки!_`

	MsgCockRaceScoreboardTemplate = `*Участники гонки коков:*

🏆 Победители в номинации:

%s

🥀 Остальным, соболезнуем:

%s

_В гонке коков легко участвовать, просто запрашивай свой кок каждый день, все коки сбрасываются каждый день по МСК_`

	MsgCockRaceScoreboardWinnersTemplate = `*Участники гонки коков:*

🏆 Победители в номинации:

%s

_В гонке коков легко участвовать, просто запрашивай свой кок каждый день, все коки сбрасываются каждый день по МСК_`
)
